name: "CIFAR10_quick_test"
layers {
  name: "data"
  type: IMAGE_DATA
  top: "data"
  top: "l1"
  image_data_param {
    source: "list_data_dlap.txt"
    batch_size: 1
    scale: 0.0039215686274
  }
}
layers {
  name: "trimap"
  type: IMAGE_DATA
  top: "trimap"
  top: "l2"
  image_data_param {
    source: "list_trimap_dlap.txt"
    batch_size: 1
    scale: 0.0078125
    bias: 128
    channels: 1
  }
}

layers {
  name: "gt"
  type: IMAGE_DATA
  top: "gt"
  top: "l3"
  image_data_param {
    source: "list_gt_dlap.txt"
    batch_size: 1
    scale: 0.0078125
    bias: 128
    channels: 1
  }
}
layers {
  name: "conv1"
  type: CONVOLUTION
  bottom: "data"
  top: "conv1"
  blobs_lr: 1
  blobs_lr: 2
  convolution_param {
    num_output: 8
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}

layers {
  name: "tanh1"
  type: TANH
  bottom: "conv1"
  top: "conv1"
}

layers {
  name: "conv2"
  type: CONVOLUTION
  bottom: "conv1"
  top: "conv2"
  blobs_lr: 1
  blobs_lr: 2
  convolution_param {
    num_output: 3
    pad: 7
    kernel_size: 15
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.0001
    }
    bias_filler {
      type: "constant"
    }
  }
}

layers {
  name: "tanh2"
  type: TANH
  bottom: "conv2"
  top: "conv2"
}

layers {
  name: "cccp1"
  type: CONVOLUTION
  bottom: "conv2"
  top: "cccp1"
  blobs_lr: 1
  blobs_lr: 2
  convolution_param {
    num_output: 1
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
    }
  }
}

layers {
  name: "tanh3"
  type: TANH
  bottom: "cccp1"
  top: "cccp1"
}
layers {
  name: "loss"
  type: MATTING
  bottom: "cccp1"
  bottom: "gt"
  bottom: "trimap"
  top: "loss"
}
